SunCity/src/Documents/АктПриемаПередачиИСЦЭДМ/АктПриемаПередачиИСЦЭДМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемаПередачиИСЦЭДМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеАктПриемаПередачиИСЦЭДМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИСЦЭДМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВИСЦЭДМ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ХозяйственныеОперацииИСЦЭДМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАкта</name>
    <type>
      <types>EnumRef.ВидыДокументаИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовИСЦЭДМ</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>DefinedType.ПоставщикПолучательИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ПоставщикПолучательИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегНомерНаБумажномНосителе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпискиНаБумажномНосителе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.ПользователиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>EnumRef.ВидыПродукцииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеныПереданыУспешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапОформления</name>
    <type>
      <types>EnumRef.ЭтапыОформленияДокументовИСЦЭДМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>DefinedType.СкладыИСЦЭДМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладЦЭДМ</name>
    <type>
      <types>CatalogRef.СкладыИСЦЭДМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикСкладЦЭДМИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСкладЦЭДМИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСверкиТоваров</name>
    <type>
      <types>EnumRef.СтатусыСверкиПолученныхКодовИСЦЭДМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходноеУведомлениеОРасхожденияхИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсточник</name>
      <comment>Количество потребительских упаковок в GTIN</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.ЕдиницаИзмеренияИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатурыИСМПТК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУпаковки</name>
      <type>
        <types>EnumRef.ВидыУпаковокИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество потребительских упаковок</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсточник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИдентификации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTINВерхнегоУровня</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТранспортнойУпаковки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Итоги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество потребительских упаковок</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатСверки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодИдентификации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>GTINВерхнегоУровня</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУпаковки</name>
      <type>
        <types>EnumRef.ВидыУпаковокИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/Enums/НаправленияДокументовИСМПТК/НаправленияДокументовИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияДокументовИСМПТК</name>
  <enumValues>
    <name>Входящий</name>
  </enumValues>
  <enumValues>
    <name>Исходящий</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Documents/АктПриемаПередачиИСЦЭДМ/Forms/ФормаСпискаДокументов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СписокНаправленийАктов.Добавить(Перечисления.НаправленияДокументовИСМПТК.Входящий,  НСтр("ru = 'Акты приема/передачи (входящие) (ИС ЦЭДМ)'"));
	СписокНаправленийАктов.Добавить(Перечисления.НаправленияДокументовИСМПТК.Исходящий, НСтр("ru = 'Акты приема/передачи (исходящие) (ИС ЦЭДМ)'"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", 		 Параметры.ВыборГруппИЭлементов);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", 			 Параметры.ЗакрыватьПриВыборе);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Параметры.ЗакрыватьПриЗакрытииВладельца);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", 	 Параметры.КлючНазначенияИспользования);
	ПараметрыФормы.Вставить("МножественныйВыбор", 			 Параметры.МножественныйВыбор);
	ПараметрыФормы.Вставить("Отбор", 						 Параметры.Отбор);
	ПараметрыФормы.Вставить("ПараметрыФункциональныхОпций",  Параметры.ПараметрыФункциональныхОпций);
	ПараметрыФормы.Вставить("РазрешитьВыборКорня", 			 Параметры.РазрешитьВыборКорня);
	ПараметрыФормы.Вставить("РежимВыбора", 					 Параметры.РежимВыбора);
	ПараметрыФормы.Вставить("ТекущаяСтрока",				 Параметры.ТекущаяСтрока);
	ПараметрыФормы.Вставить("ТолькоПросмотр",				 Параметры.ТолькоПросмотр);
	ПараметрыФормы.Вставить("ФиксированныеНастройки",		 Параметры.ФиксированныеНастройки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ

&НаКлиенте
Процедура СписокНаправленийАктовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = СписокНаправленийАктов.НайтиПоИдентификатору(ВыбраннаяСтрока);	
	ОткрытьСписокАктов(СтрокаТаблицы.Значение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьСписок(Команда)
	
	СтрокаТаблицы = Элементы.СписокНаправленийАктов.ТекущиеДанные;
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		ОткрытьСписокАктов(СтрокаТаблицы.Значение);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОткрытьСписокАктов(НаправлениеАкт)
	
	Если НаправлениеАкт = ПредопределенноеЗначение("Перечисление.НаправленияДокументовИСМПТК.Входящий") Тогда
		ОткрытьФорму("Документ.АктПриемаПередачиИСЦЭДМ.Форма.ФормаСпискаВходящих", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Документ.АктПриемаПередачиИСЦЭДМ.Форма.ФормаСпискаИсходящих", ПараметрыФормы);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры
